Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ16MC101.h
#define WDTPOST_PS1          0x3FF0
#define WDTPOST_PS2          0x3FF1
#define WDTPOST_PS4          0x3FF2
#define WDTPOST_PS8          0x3FF3
#define WDTPOST_PS16         0x3FF4
#define WDTPOST_PS32         0x3FF5
#define WDTPOST_PS64         0x3FF6
#define WDTPOST_PS128        0x3FF7
#define WDTPOST_PS256        0x3FF8
#define WDTPOST_PS512        0x3FF9
#define WDTPOST_PS1024       0x3FFA
#define WDTPOST_PS2048       0x3FFB
#define WDTPOST_PS4096       0x3FFC
#define WDTPOST_PS8192       0x3FFD
#define WDTPOST_PS16384      0x3FFE
#define WDTPOST_PS32768      0x3FFF

#define WDTPRE_PR32          0x3FEF
#define WDTPRE_PR128         0x3FFF

#define PLLKEN_OFF           0x3FDF
#define PLLKEN_ON            0x3FFF

#define WINDIS_ON            0x3FBF
#define WINDIS_OFF           0x3FFF

#define FWDTEN_OFF           0x3F7F
#define FWDTEN_ON            0x3FFF

#define ICS_PGD3             0x3DFF
#define ICS_PGD2             0x3EFF
#define ICS_PGD1             0x3FFF

#define HPOL_OFF             0x3BFF
#define HPOL_ON              0x3FFF

#define GWRP_ON              0x2FFF
#define GWRP_OFF             0x3FFF

#define GCP_ON               0x1FFF
#define GCP_OFF              0x3FFF



/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define ___RESERVED_BASE 0x100
#define ___RESERVED_LENGTH 0x4

#define __AIVT_BASE 0x104
#define __AIVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x29fc

#define __CONFIG2_BASE 0x2bfc
#define __CONFIG2_LENGTH 0x2

#define __CONFIG1_BASE 0x2bfe
#define __CONFIG1_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x400


#endif
